Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: ["spinner control (GUI)","commands/GuiControls.htm#UpDown"],
pt_br: ["Controle spinner (GUI)","commands/GuiControls.htm#UpDown"],

source: ["splitting long lines","Scripts.htm#continuation"],
pt_br: ["quebrar linhas longas","Scripts.htm#continuation"],

source: ["standard library","Functions.htm#lib"],
pt_br: ["biblioteca padrão","Functions.htm#lib"],

source: ["standard output (stdout)","commands/FileAppend.htm"],
pt_br: ["saída padrão (stdout)","commands/FileAppend.htm"],

source: ["static variables","Functions.htm#static"],
pt_br: ["variáveis estáticas","Functions.htm#static"],

source: ["static","Functions.htm#static",5],
pt_br: ["estáticas","Functions.htm#static",5],

source: ["string (search for)","commands/InStr.htm"],
pt_br: ["string (buscar uma)","commands/InStr.htm"],

source: ["structures, via DllCall","commands/DllCall.htm#struct"],
pt_br: ["estruturas, via DllCall","commands/DllCall.htm#struct"],

source: ["styles for GUI command","misc/Styles.htm"],
pt_br: ["estilos relativos ao comando GUI","misc/Styles.htm"],

source: ["subtract","commands/EnvSub.htm"],
pt_br: ["subtrair","commands/EnvSub.htm"],

source: ["suspend or hibernate","commands/Shutdown.htm#Suspend"],
pt_br: ["suspender ou hibernar o computador","commands/Shutdown.htm#Suspend"],

source: ["terminate a window","commands/WinKill.htm"],
pt_br: ["finalizar uma janela","commands/WinKill.htm"],

source: ["terminate script","commands/ExitApp.htm"],
pt_br: ["finalizar o script","commands/ExitApp.htm"],

source: ["ternary operator (?:)","Variables.htm#ternary"],
pt_br: ["operador ternário (?:)","Variables.htm#ternary"],

source: ["text-mode Send","commands/Send.htm#SendText"],
pt_br: ["Send, em modo texto","commands/Send.htm#SendText"],

source: ["threads","misc/Threads.htm"],
pt_br: ["fios de execução","misc/Threads.htm"],

source: ["time","commands/IfIs.htm"],
pt_br: ["time (tipo de dados)","commands/IfIs.htm"],

source: ["times and dates (compare)","commands/EnvSub.htm"],
pt_br: ["horários e datas (comparar)","commands/EnvSub.htm"],

source: ["times and dates (math)","commands/EnvAdd.htm"],
pt_br: ["horários e datas (operações matemáticas)","commands/EnvAdd.htm"],

source: ["times and dates (of files)","commands/FileSetTime.htm"],
pt_br: ["horários e datas (de arquivos)","commands/FileSetTime.htm"],

source: ["title of a window","commands/WinSetTitle.htm"],
pt_br: ["título de uma janela","commands/WinSetTitle.htm"],

source: ["transparency of a window","commands/WinSet.htm#trans"],
pt_br: ["transparência de uma janela","commands/WinSet.htm#trans"],

source: ["tray icon","Program.htm#tray-icon"],
pt_br: ["ícone da bandeja","Program.htm#tray-icon"],

source: ["tray menu (customizing)","commands/Menu.htm"],
pt_br: ["menu da área de notificação (personalizar)","commands/Menu.htm"],

source: ["user (run as a different user)","commands/RunAs.htm"],
pt_br: ["usuário (executar como um usuário diferente)","commands/RunAs.htm"],

source: ["user library","Functions.htm#lib"],
pt_br: ["biblioteca do usuário","Functions.htm#lib"],

source: ["variables","Variables.htm"],
pt_br: ["Variáveis","Variables.htm"],

source: ["variables, ListVars","commands/ListVars.htm"],
pt_br: ["variáveis, ListVars","commands/ListVars.htm"],

source: ["variables, assigning to","commands/SetEnv.htm"],
pt_br: ["Variáveis, atribuindo valores a","commands/SetEnv.htm"],

source: ["variables, built-in","Variables.htm#BuiltIn"],
pt_br: ["Variáveis, nativas","Variables.htm#BuiltIn"],

source: ["variables, comparing them","commands/IfEqual.htm"],
pt_br: ["variáveis, compará-las","commands/IfEqual.htm"],

source: ["variables, type of data","commands/IfIs.htm"],
pt_br: ["variáveis, tipo de dados","commands/IfIs.htm"],

source: ["variadic functions","Functions.htm#Variadic"],
pt_br: ["Funções variádicas","Functions.htm#Variadic"],

source: ["variants (duplicate hotkeys and hotstrings)","commands/_IfWinActive.htm#variant"],
pt_br: ["variantes (hotkeys e hotstrings duplicadas)","commands/_IfWinActive.htm#variant"],

source: ["version of a file","commands/FileGetVersion.htm"],
pt_br: ["versão de um arquivo","commands/FileGetVersion.htm"],

source: ["virtual key","commands/Send.htm#vk"],
pt_br: ["tecla virtual","commands/Send.htm#vk"],

source: ["volume (changing it)","commands/SoundSet.htm"],
pt_br: ["volume (aumentar/diminuir)","commands/SoundSet.htm"],

source: ["wait (sleep)","commands/Sleep.htm"],
pt_br: ["esperar (sleep)","commands/Sleep.htm"],

source: ["wait for a key to be released or pressed","commands/KeyWait.htm"],
pt_br: ["aguardar pelo pressionamento ou soltura de uma tecla","commands/KeyWait.htm"],

source: ["whitespace","commands/AutoTrim.htm"],
pt_br: ["espaço em branco","commands/AutoTrim.htm"],

source: ["wildcards (for files & folders)","commands/LoopFile.htm"],
pt_br: ["curingas (para arquivos e pastas)","commands/LoopFile.htm"],

source: ["window group","misc/WinTitle.htm#ahk_group"],
pt_br: ["grupo de janelas","misc/WinTitle.htm#ahk_group"],

source: ["window messages","misc/SendMessageList.htm"],
pt_br: ["mensagens do Windows","misc/SendMessageList.htm"],

source: ["working directory","commands/SetWorkingDir.htm"],
pt_br: ["diretório de trabalho","commands/SetWorkingDir.htm"],

source: ["write file","commands/FileAppend.htm"],
pt_br: ["adicionar texto a um arquivo","commands/FileAppend.htm"],

source: ["{ ... } (block)","commands/Block.htm"],
pt_br: ["{ ... } (bloco)","commands/Block.htm"],

source: ^VK24::MsgBox You pressed Home or NumpadHome while holding down Control.
pt_br: ^VK24::MsgBox Você pressionou Home ou NumpadHome enquanto mantinha pressionada a tecla Control.

source: ^a::MsgBox You pressed Control-A while Notepad is active.
pt_br: ^a::MsgBox Você pressionou Ctrl+A enquanto o Bloco de Notas estava ativo.

source: ahk, autohotkey, tutorial, beginners guide
pt_br: ahk, autohotkey, tutorial, guia para iniciantes

source: b is B and 5 is 5.
pt_br: b é B e 5 é 5.

source: basic usage and examples.
pt_br: noções básicas de uso e exemplos.

source: details about limitations.
pt_br: detalhes sobre limitações.

source: en
pt_br: pt-BR

source: explanations of various things you need to know.
pt_br: explicações de várias coisas que você deve saber.

source: how to write scripts.
pt_br: Como escrever scripts

source: if (MyVar = 5)
pt_br: if (MinhaVariavel = 5)

source: if (Number = 6)
pt_br: if (Numero = 6)

source: if (OutputVar = "Bill")
pt_br: if (OutputVar = "Leo")

source: if (OutputVar2 = "yes")
pt_br: if (OutputVar2 = "sim")

source: if (Var != Number)
pt_br: if (Var != Numero)

source: if (car = "old")
pt_br: if (carro = "velho")

source: if (wheels = "flat")
pt_br: if (pneu = "murcho")

source: if KeepWinZRunning
pt_br: if ManterWinZRodando

source: if Number = 6
pt_br: if Numero = 6

source: if WinExist("Untitled - Notepad")
pt_br: if WinExist("Sem título - Notepad")

source: if not KeepWinZRunning
pt_br: if not ManterWinZRodando

source: keyboard,keys,key,mouse,buttons,button,joystick,create,hotkeys,hotkey,macros
pt_br: teclado,teclas,tecla,mouse,botões,botão,hoystick,criar,hotkeys,hotkey,teclas de atalho,macros

source: myObj.name
pt_br: meuObjeto.name

source: myObj.name := value
pt_br: meuObjeto.name := valor

source: myObj.name(arg2, ..., argN)
pt_br: meuObjeto.name(arg2, ..., argN)

source: myObj.name(arg2, ..., argN) := value
pt_br: meuObjeto.name(arg2, ..., argN) := valor

source: myObj.name[arg2, ..., argN]
pt_br: meuObjeto.name[arg2, ..., argN]

source: myObj.name[arg2, ..., argN] := value
pt_br: meuObjeto.name[arg2, ..., argN] := valor

source: myObj[arg1, arg2, ..., argN]
pt_br: meuObjeto[arg1, arg2, ..., argN]

source: myObj[arg1, arg2, ..., argN] := value
pt_br: meuObjeto[arg1, arg2, ..., argN] := valor

source: myObj[arg1](arg2, ..., argN)
pt_br: meuObjeto[arg1](arg2, ..., argN)

source: sends the left virtual key rather than the neutral one)
pt_br: envia a tecla virtual da esquerda em vez da neutra)

source: sends the neutral virtual key but the left scan code)
pt_br: envia a tecla virtual neutra mas o código de leitura esquerdo)

source: string, number or object.
pt_br: string, número ou objeto.

source: they affect all hotkeys and hotstrings physically beneath them in the script.
pt_br: elas afetam todas as hotkeys e hotstrings fisicamente abaixo delas no script.

source: {Backspace} or {BS}
pt_br: {Backspace} ou {BS}

source: {Control down} or {Ctrl down}
pt_br: {Control down} ou {Ctrl down}

source: {Control} or {Ctrl}
pt_br: {Control} ou {Ctrl}

source: {Delete} or {Del}
pt_br: {Delete} ou {Del}

source: {Escape} or {Esc}
pt_br: {Escape} ou {Esc}

source: {F12} is F12.
pt_br: {F12} é F12.

source: {Insert} or {Ins}
pt_br: {Insert} ou {Ins}

source: {LControl} or {LCtrl}
pt_br: {LControl} ou {LCtrl}

source: {RControl} or {RCtrl}
pt_br: {RControl} ou {RCtrl}

source: ~j::
pt_br: ~h::

source: ©2003-2014 Chris Mallett, portions ©AutoIt Team and the AHK community
pt_br: ©2003-2014 Chris Mallett, porções de ©AutoIt Team e a comunidade do AHK. A tradução brasileiro-português foi preparada por Leo Carmo.
